mymy49/yss/stm32f030r8/GL17SGM/prj/src/bsp.cpp
////////////////////////////////////////////////////////////////////////////////////////
//
// 저작권 표기 License_ver_2.0
// 본 소스코드의 소유권은 yss Embedded Operating System 네이버 카페 관리자와 운영진에게 있습니다.
// 운영진이 임의로 코드의 권한을 타인에게 양도할 수 없습니다.
// 본 소스코드는 아래 사항에 동의할 경우에 사용 가능합니다.
// 아래 사항에 대해 동의하지 않거나 이해하지 못했을 경우 사용을 금합니다.
// 본 소스코드를 사용하였다면 아래 사항을 모두 동의하는 것으로 자동 간주 합니다.
// 본 소스코드의 상업적 또는 비상업적 이용이 가능합니다.
// 본 소스코드의 내용을 임의로 수정하여 재배포하는 행위를 금합니다.
// 본 소스코드의 내용을 무단 전재하는 행위를 금합니다.
// 본 소스코드의 사용으로 인해 발생하는 모든 사고에 대해서 어떤한 법적 책임을 지지 않습니다.
//
//  Home Page : http://cafe.naver.com/yssoperatingsystem
//  Copyright 2021. yss Embedded Operating System all right reserved.
//
//  주담당자 : 아이구 (mymy49@nate.com) 2021.05.02 ~ 현재
//  부담당자 : -
//
////////////////////////////////////////////////////////////////////////////////////////

#include <yss/yss.h>

static unsigned char gUartRcvBuff[256];

void initSystem(void)
{
    clock.pll.enable(
        define::clock::pll::src::HSI, // unsigned char src;
        12,                           // unsigned char mul;
        0                             // unsigned char div;
    );

    clock.setSysclk(
        define::clock::sysclk::src::PLL,       // unsigned char sysclkSrc;
        define::clock::divFactor::ahb::NO_DIV, // unsigned char ahb;
        define::clock::divFactor::apb::NO_DIV, // unsigned char apb1;
        define::clock::divFactor::apb::NO_DIV  // unsigned char apb2;
    );

    flash.setPrefetchEn(true);

#if defined(GPIOA)
    clock.peripheral.setGpioAEn(true);
#endif
#if defined(GPIOB)
    clock.peripheral.setGpioBEn(true);
#endif
#if defined(GPIOC)
    clock.peripheral.setGpioCEn(true);
#endif
#if defined(GPIOD)
    clock.peripheral.setGpioDEn(true);
#endif
#if defined(GPIOE)
    clock.peripheral.setGpioEEn(true);
#endif
#if defined(GPIOF)
    clock.peripheral.setGpioFEn(true);
#endif
#if defined(GPIOH)
    clock.peripheral.setGpioHEn(true);
#endif
}

namespace Bsp
{
void init(void)
{
    //UART1 초기화 9600 baudrate, 수신 링버퍼 크기는 256 바이트
    using namespace define::gpio;
    gpioB.setToAltFunc(6, altfunc::PB6_USART1_TX);
    gpioB.setToAltFunc(7, altfunc::PB7_USART1_RX);

    uart1.setClockEn(true);
    uart1.init(9600, gUartRcvBuff, 256);
    uart1.setIntEn(true);
}
}